Revit 2024 API
TrussMemberInfo Class
Provides access to the information of a truss member in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class TrussMemberInfo
Visual Basic
Public Class TrussMemberInfo
Visual C++
public ref class TrussMemberInfo
Remarks
A struct TrussMemberInfo that contains an element's host truss, whether to lock to the truss, usage type, etc.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.TrussMemberInfo
See Also
TrussMemberInfo Members
Autodesk.Revit.DB.Structure Namespace